rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    //SEGGER_RTT_printf(0, "Byte %u = 0x%x\n", i, *(settings_state + i));
    
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    ret_code_t                err_code;
    //nrf_ble_qwr_init_t        qwr_init = {0};
    ble_sensor_service_init_t init  = {0};

    // Initialize Queued Write Module.
    //qwr_init.error_handler = nrf_qwr_error_handler;

    //err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    //APP_ERROR_CHECK(err_code);

    // Initialize sensor service
    init.setting_write_handler = sensor_settings_write_handler;

    err_code = ble_sensor_service_init(&m_ss, &init, SENSOR_SETTINGS_LENGTH);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    ret_code_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for starting timers.
 */
static void application_timers_start(void)
{
    //a timer that let's us know when to read the next data sample from the Sensor
    //app_timer_start(m_data_reading_timer, NEXT_MEASUREMENT_DELAY, NULL);
    app_timer_start(m_led_timer, LED_DELAY, NULL); //blinks the green led along with the advertising interval
}

void on_gap_connection_handler()
{
    //This handler method gets called every time a new connection is initiated
    connected_mode_start();
    float new_sensor_odr = sensor_odr_calculate();
    if (new_sensor_odr != current_sensor_odr)
    {
        if (update_connection_interval(new_sensor_odr) != NRF_SUCCESS) SEGGER_RTT_WriteString(0, "Couldn't update connection interval.\n");
        else current_sensor_odr = new_sensor_odr;
    }
}

void on_gap_disconnection_handler()
{
    //This handler method gets called when a connection is lost
    advertising_mode_start();
}

/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


static void leds_init()
{
    //configure the pins for the BLE 33 Sense on-board red, green and blue tri-colored LED.
    nrf_gpio_cfg_output(RED_LED);
    nrf_gpio_cfg_output(BLUE_LED);
    nrf_gpio_cfg_output(GREEN_LED);

    //these LEDs are situated backwards from what you would expect so the pin needs to be 
    //pulled high for the LEDs to turn off
    nrf_gpio_pin_set(RED_LED);
    nrf_gpio_pin_set(BLUE_LED);
    nrf_gpio_pin_set(GREEN_LED);
}

/**@brief Function for application main entry.
 */
int main(void)
 {
    bool erase_bonds;

    //Create a structure for BLE handler methods
    ble_event_handler_t ble_handlers;
    ble_handlers.gap_connected_handler = on_gap_connection_handler;
    ble_handlers.gap_disconnected_handler = on_gap_disconnection_handler;

    //Initialize.
    log_init();
    timers_init();
    power_management_init();
    ble_stack_init(&ble_handlers, &m_conn_handle, &m_notification_done);
    gatt_init();
    services_init();
    twi_init();
    sensors_init(true);
    gap_params_init(current_sensor_odr);
    advertising_init();
    conn_params_init();
    peer_manager_init();
    leds_init();

    //Start execution.
    application_timers_start();
    advertising_start(erase_bonds);

    //Enter main loop.
    for (;;)
    {
        idle_state_handle(); //puts CPU into sleep and waits for an event signal to wake it up

        //after the CPU get's woken up (at a minimum this should happen once every
        //connection interval), see if the data ready flag has been set to true and
        //if so, send out data notifications).
        if (m_data_ready)
        {
            characteristic_update_and_notify();
            m_data_ready = false;
            //SEGGER_RTT_printf(0, "Sending notification %d\n", ++adv_num);
        }
    }
}